daboluocc/bbclaw/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# 与常见 8MB SPI Flash 一致；若写 4MB 而芯片为 8MB 会告警且 esptool 只认 header 容量
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 面包板调试：Mac en0 (192.168.1.x WiFi) 实际 IP；覆盖 Kconfig 默认 192.168.10.26
# 真生产 PCB 不要 commit 此行，或换成其他 sdkconfig.defaults.* 文件单独存放
CONFIG_BBCLAW_ADAPTER_BASE_URL="http://192.168.1.2:18080"
# bb_http_resp_t.body[8192] + 调用链：须大于 8K，否则 main 任务栈溢出（见 bb_cloud_pair_request）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
# LVGL 偶发整屏 SW 合成较慢时给 IDLE 留出余量（默认 5s 可能偏紧）
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# OTA 分区布局（partitions_ota.csv）：factory 1M + ota_0/ota_1 各 2.5M + resources 1M。
# LVGL 字库 + 应用体积超过 single_app_large 的 1500K 上限，所以 ota_0/ota_1 各预留 2.5M。
# 主固件烧到 ota_0（0x120000），由 otadata 选择启动槽——见 firmware/Makefile 的 flash-ota0 目标。
# CLAUDE.md 也说明：cloud_saas 模式下设备启动后通过 GET /v1/ota/check 拉新版固件。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"

# lv_font_conv 默认输出压缩位图；未开启则 get_bitmap 恒为 NULL → 中英文皆方框
CONFIG_LV_USE_FONT_COMPRESSED=y
# 全量 CJK 字库 bitmap 常 >1MB；关闭时 glyph bitmap_index 仅 20 位会溢出错位
CONFIG_LV_FONT_FMT_TXT_LARGE=y

# 待机大屏时钟（仅数字与 ASCII，可与 CJK 并存）
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# SNTP（bb_sntp_start → pool.ntp.org）
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# PSRAM (ESP-PSRAM64H, 8MB Quad SPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# Device Monitor (ADR-015 v3 pivot): chip native USB exposed via CH334F hub
# on the production PCB. TinyUSB exposes two CDC interfaces: CDC0 carries
# log output (replaces USJ console), CDC1 carries the binary frame protocol
# for screenshot / key injection.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=2
# LVGL snapshot module — needed by the REQ_SCREENSHOT handler to capture
# lv_screen_active() into an RGB565 buffer.
CONFIG_LV_USE_SNAPSHOT=y
# LVGL allocator: custom PSRAM-first (src/bb_lvgl_mem.c). History:
#   builtin static pool → 64KB 池放不下 110KB snapshot buffer；
#   CLIB malloc → 配合 SPIRAM_MALLOC_ALWAYSINTERNAL=16384，每个小 lv_obj
#   都落内部 RAM —— 点阵 UI 的数百个 dot 对象把内部堆吃碎，运行时
#   websocket task 8KB 连续栈拿不到（internal_largest=7680）→ 语音流挂。
# custom 分配器把所有 LVGL 分配导去 PSRAM（内部 RAM 兜底），内部 RAM
# 留给 task 栈 / WiFi+I2S DMA 这些只能用内部的场景。
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
# CONFIG_LV_USE_CLIB_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y

# 内部 RAM 保留水位 32K→64K：可去 PSRAM 的 malloc 更早转移到 PSRAM，
# 不再把内部堆抽干到 xTaskCreate 失败的程度。
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# WiFi/LWIP 动态缓冲改从 PSRAM 分配（OCT PSRAM @80MHz，DMA-capable）。
# 默认这些缓冲(DYNAMIC_RX/TX_BUFFER_NUM=32 各 ~1.6KB + LWIP mbox)全落内部 DRAM，
# 几十块 1.6KB 把内部堆打碎，最大连续块卡在 ~8.7KB < adapter ws 任务 8192B 栈
# → Error create websocket task → 语音流挂(button_test 修复后 largest 仅到 8704
# 仍跨不过去，证明根因是 WiFi 缓冲的内部碎片)。挪去 PSRAM 后内部 RAM 腾出几十 KB、
# 碎片消失，largest 回到 8192 以上。
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 渲染性能（issue #149 Round 1）：-O2 + 240MHz + 1ms tick + 60fps 刷新上限。
# LVGL 软渲染对优化级别极敏感；FREERTOS 100Hz 时 10ms 调度粒度会造成帧间抖动。
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_DEF_REFR_PERIOD=16
